<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>4.&nbsp;CPS&#19982;&#32593;&#32476;&#27969;&#31243;&#25511;&#21046;</title><link rel="stylesheet" href="html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.69.1"><link rel="start" href="index.html" title="Java&#32593;&#32476;&#31243;&#24207;&#21592;&#30475;Continuation"><link rel="up" href="ch01.html" title="Chapter&nbsp;1.&nbsp;CPS&#19982;&#32593;&#32476;&#31243;&#24207;&#27969;&#31243;&#25511;&#21046;"><link rel="prev" href="ch01s03.html" title="3.&nbsp;CPS&#19982;goto"><link rel="next" href="ch02.html" title="Chapter&nbsp;2.&nbsp;Continuation&#65292;call/cc&#20989;&#25968;&#19982;&#22238;&#36864;&#65295;&#21047;&#26032;&#38190;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">4.&nbsp;CPS&#19982;&#32593;&#32476;&#27969;&#31243;&#25511;&#21046;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch01s03.html">Prev</a>&nbsp;</td><th width="60%" align="center">Chapter&nbsp;1.&nbsp;CPS&#19982;&#32593;&#32476;&#31243;&#24207;&#27969;&#31243;&#25511;&#21046;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch02.html">Next</a></td></tr></table><hr></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e107"></a>4.&nbsp;CPS&#19982;&#32593;&#32476;&#27969;&#31243;&#25511;&#21046;</h2></div></div></div><p>&#30475;&#20102;&#19978;&#38754;&#30340;&#20363;&#23376;&#65292;&#24744;&#21487;&#33021;&#24456;&#36855;&#33579;&#12290;&#22914;&#26524;CPS&#31243;&#24207;&#36825;&#26679;&#21476;&#24618;&#65292;&#25105;&#20204;&#20026;&#20160;&#20040;&#35201;&#29992;&#23427;&#20889;&#32593;&#32476;&#31243;&#24207;&#65311;&#38590;&#36947;&#25105;&#20204;&#31361;&#28982;&#21457;&#29616;goto&#27604;while&#22909;&#29992;&#65311;&#36825;&#20010;&#38382;&#39064;&#30340;&#31572;&#26696;&#27491;&#22909;&#26159;&#21453;&#36807;&#26469;&#30340;&#65306;&#20256;&#32479;&#30340;&#32593;&#32476;&#31243;&#24207;&#20854;&#23454;&#23601;&#26159;&#29992;CPS&#39118;&#26684;&#20889;&#25104;&#30340;&#65288;&#21363;goto&#65289;&#65292;&#32780;&#25105;&#20204;&#21363;&#23558;&#29992;continuation&#30340;&#27010;&#24565;&#37325;&#26032;&#8220;&#21457;&#26126;&#8221;while&#32467;&#26500;&#12290;</p><p>&#24744;&#19981;&#30456;&#20449;&#65311;&#25105;&#20204;&#20877;&#26469;&#30475;&#30475;&#29468;&#25968;&#23383;&#36825;&#20010;&#28216;&#25103;&#12290;&#22914;&#26524;&#29616;&#22312;&#24744;&#35201;&#20889;&#19968;&#20010;Java&#25110;&#32773;PHP&#30340;&#32593;&#32476;&#29468;&#25968;&#23383;&#28216;&#25103;&#65292;&#24744;&#20250;&#24590;&#20040;&#20889;&#65311;&#35753;&#25105;&#26469;&#29468;&#29468;&#65292;&#24744;&#20250;&#20889;&#19968;&#20010;welcome&#39029;&#38754;&#65292;&#35813;&#39029;&#38754;&#20063;&#36127;&#36131;&#21021;&#22987;&#21270;&#25972;&#20010;&#28216;&#25103;&#65292;&#20363;&#22914;&#23558;&#31572;&#26696;&#35774;&#32622;&#25104;&#19968;&#20010;&#38543;&#26426;&#25968;&#12290;&#28982;&#21518;&#24744;&#20250;&#20889;&#19968;&#20010;prompt&#39029;&#38754;&#65292;&#19978;&#38754;&#35828;&#65306;Guess a number [0, 100]&#65292;&#21518;&#38754;&#26159;&#19968;&#20010;&#25991;&#26412;&#26694;&#12290;&#24403;&#29992;&#25143;&#25353;submit&#25353;&#38062;&#20043;&#21518;&#65292;&#20182;&#30340;&#31572;&#26696;&#20250;&#25552;&#20132;&#21040;guess&#39029;&#38754;&#65292;&#35813;&#39029;&#38754;&#20250;&#21578;&#35785;&#20182;&#31572;&#26696;&#26159;&#22826;&#22823;&#36824;&#26159;&#22826;&#23567;&#36824;&#26159;&#27491;&#30830;&#12290;&#22914;&#26524;&#31572;&#26696;&#27491;&#30830;&#65292;&#37027;&#20040;&#29992;&#25143;&#20250;&#34987;redirect&#33267;finishgame&#39029;&#38754;&#65292;&#21542;&#21017;&#20250;redirect&#22238;prompt&#39029;&#38754;&#12290;&#22914;&#27492;&#31561;&#31561;&#12290;&#24744;&#21457;&#29616;&#20160;&#20040;&#38382;&#39064;&#20102;&#21527;&#65311;</p><p>&#19981;&#38169;&#65292;&#24744;&#27491;&#22312;&#29992;CPS&#39118;&#26684;&#65292;&#23601;&#31639;&#24744;&#20043;&#21069;&#20174;&#26469;&#27809;&#26377;&#21548;&#35828;&#36807;continuation&#12290;&#32593;&#32476;&#30340;welcome&#39029;&#38754;&#23545;&#24212;&#20110;CPS&#30340;main&#20989;&#25968;&#65292;prompt&#39029;&#38754;&#23545;&#24212;&#20110;prompt&#20989;&#25968;&#65292;guess&#39029;&#38754;&#23545;&#24212;&#20110;guess&#20989;&#25968;&#65292;finishgame&#39029;&#38754;&#23545;&#24212;&#19982;finishgame&#20989;&#25968;&#12290;&#36923;&#36753;&#20013;&#30340;while&#32467;&#26500;&#22312;&#20004;&#32773;&#20013;&#37117;&#27809;&#26377;&#20102;&#65292;&#25913;&#30001;prompt&#21644;guess&#20043;&#38388;&#30340;&#20114;&#30456;&#35843;&#29992;&#65288;&#20063;&#21363;goto&#65289;&#26469;&#23436;&#25104;&#12290;</p><p>&#32593;&#32476;&#31243;&#24207;&#20043;&#25152;&#20197;&#22914;&#27492;&#21476;&#24618;&#65292;&#23601;&#26159;&#22240;&#20026;&#25105;&#20204;&#26377;&#19968;&#20010;CPS&#32467;&#26500;&#30340;print&#12290;&#27599;&#27425;&#29983;&#25104;&#39029;&#38754;&#20043;&#21518;&#65292;&#25105;&#20204;&#30340;servlet&#25110;&#32773;PHP script&#23601;&#20013;&#27490;&#20102;&#12290;&#19981;&#36807;&#65292;&#22312;&#25105;&#20204;&#30340;&#39029;&#38754;&#20013;&#21364;&#38544;&#34255;&#20102;&#24456;&#22810;continuation&#65292;&#21448;&#21517;URL&#12290;&#29992;&#25143;&#25805;&#20316;&#20043;&#21518;&#65292;&#25105;&#20204;&#30340;&#31243;&#24207;&#20174;&#36825;&#20123;continuation&#32487;&#32493;&#25191;&#34892;&#12290;&#25152;&#20197;&#65292;&#25105;&#20204;&#22312;&#19981;&#30693;&#19981;&#35273;&#20013;&#37117;&#22312;&#29992;CPS&#65292;&#20854;&#38382;&#39064;&#20063;&#38543;&#20043;&#32780;&#26469;&#65306;</p><div class="orderedlist"><ol type="1"><li><p>&#20961;&#26159;&#19981;&#27490;&#19968;&#20010;&#39029;&#38754;&#35201;&#29992;&#21040;&#30340;&#21464;&#37327;&#37117;&#24517;&#39035;&#25918;&#22312;session&#20013;&#65292;&#20107;&#23454;&#19978;&#65292;&#23601;&#26159;&#21464;&#25104;&#20102;&#20840;&#23616;&#21464;&#37327;&#12290;</p></li><li><p>&#27809;&#26377;while&#31561;&#25511;&#21046;&#32467;&#26500;&#12290;&#36825;&#27491;&#26159;cocoon control flow&#31561;&#25216;&#26415;&#35797;&#22270;&#35299;&#20915;&#30340;&#38382;&#39064;&#65292;&#21487;&#24796;&#30340;&#26159;&#65292;&#36825;&#20123;&#35299;&#20915;&#26041;&#27861;&#24448;&#24448;&#35201;&#24341;&#20837;&#21035;&#30340;xml&#26684;&#24335;&#25110;&#32773;&#26694;&#26550;&#65292;&#19982;&#25105;&#20204;&#30340;&#31532;&#19968;&#20010;&#29468;&#25968;&#23383;&#28216;&#25103;&#30340;&#31616;&#27905;&#26080;&#27861;&#27604;&#25311;&#12290;</p></li><li><p>&#25226;&#25511;&#21046;&#20256;&#36882;&#32473;&#21478;&#19968;&#20010;&#39029;&#38754;&#23481;&#26131;&#65292;&#35843;&#29992;&#21478;&#19968;&#20010;&#39029;&#38754;&#21364;&#24456;&#38590;&#12290; &#27604;&#26041;&#35828;&#65292;&#24744;&#21487;&#20197;&#20889;&#19968;&#20010;&#39029;&#38754;&#65292;&#35753;&#29992;&#25143;&#29992;&#21508;&#31181;&#26041;&#27861;&#26597;&#35810;&#19968;&#20010;&#33322;&#29677;&#21495;&#12290;&#21487;&#26159;&#22914;&#26524;&#26576;&#20010;&#31243;&#24207;&#26377;&#20960;&#20010;&#34920;&#26684;&#65292;&#27599;&#20010;&#34920;&#26684;&#37324;&#26377;&#20960;&#20010;&#33322;&#29677;&#21495;&#38656;&#35201;&#22635;&#20889;&#65292;&#24744;&#33021;&#19981;&#33021;&#22312;&#27599;&#20010;&#25991;&#26412;&#26694;&#26049;&#36793;&#21152;&#19968;&#20010;&#8220;&#26597;&#35810;&#8221;&#38142;&#25509;&#65311;&#20063;&#35768;&#24744;&#21487;&#20197;&#65292;&#20294;&#26159;&#24744;&#19981;&#24471;&#19981;&#33258;&#24049;&#24819;&#19968;&#20010;&#21150;&#27861;&#26469;&#36890;&#30693;&#35813;&#26597;&#35810;&#39029;&#38754;&#65292;&#25214;&#21040;&#33322;&#29677;&#21495;&#20043;&#21518;&#24590;&#20040;&#21150;&#65311;&#36820;&#22238;&#21738;&#20010;&#39029;&#38754;&#65311;&#23545;&#35813;&#39029;&#38754;&#30340;&#25968;&#25454;&#36827;&#34892;&#20160;&#20040;&#20462;&#25913;&#65311;&#32780;&#22312;&#26700;&#38754;&#31243;&#24207;&#20013;&#65292;&#26597;&#35810;&#39029;&#38754;&#21482;&#39035;&#36820;&#22238;&#35813;&#33322;&#29677;&#21495;&#65292;&#35843;&#29992;&#35813;&#39029;&#38754;&#30340;&#20195;&#30721;&#23601;&#21487;&#20197;&#32487;&#32493;&#25191;&#34892;&#23545;&#35813;&#33322;&#29677;&#21495;&#30340;&#25805;&#20316;&#65292;&#27604;&#22914;&#21152;&#20837;&#21040;&#26576;&#20010;&#25991;&#26412;&#26694;&#20013;&#12290;&#21478;&#22806;&#65292;&#22810;&#35874;&#32769;&#22825;&#20284;&#20046;&#27809;&#26377;&#20154;&#22312;&#32593;&#32476;&#19978;&#20889;&#38656;&#35201;&#22238;&#28335;&#30340;&#31243;&#24207;&#65292;&#21542;&#21017;&#25105;&#20204;&#38656;&#35201;&#33258;&#24049;&#23545;&#22534;&#36827;&#34892;&#31649;&#29702;&#12290;&#26412;&#25991;&#21518;&#38754;&#36824;&#20250;&#35762;&#21040;&#36825;&#20010;&#38382;&#39064;&#12290;</p></li><li><p>&#22312;&#32593;&#32476;&#31243;&#24207;&#20013;&#65292;&#25105;&#20204;&#20854;&#23454;&#36824;&#19981;&#33021;&#30452;&#25509;&#29992;continuation&#12290;&#25105;&#20204;&#39318;&#20808;&#35201;&#25226;&#35813;continuation&#21464;&#25104;&#19968;&#20010;&#23383;&#31526;&#20018;&#34255;&#22312;URL&#20013;&#65292;&#20363;&#22914;item=4&amp;action=delete&#65292;&#31561;&#21040;&#23458;&#25143;&#31471;&#25552;&#20132;&#35831;&#27714;&#26102;&#20877;&#22788;&#29702;URL&#20013;&#30340;&#23383;&#20018;&#65292;&#25165;&#33021;&#33719;&#24471;&#35813;continuation&#65292;&#20363;&#22914;&#65292;performDeleteAction(getItemByIndex(4))&#12290;&#25442;&#20010;&#24120;&#29992;&#30340;&#35828;&#27861;&#65292;&#23601;&#26159;&#39029;&#38754;&#38388;&#21482;&#33021;&#20256;&#36882;string&#32780;&#19981;&#33021;&#20256;&#36882;&#23545;&#35937;&#25110;&#32773;&#31243;&#24207;&#29366;&#24577;&#12290;</p></li></ol></div><p>&#22914;&#26524;&#25105;&#20204;&#21482;&#33021;&#36825;&#26679;&#25209;&#35780;&#19968;&#19979;&#32593;&#32476;&#31243;&#24207;&#65292;&#37027;&#20040;&#24744;&#20063;&#23601;&#19981;&#38656;&#35201;&#30475;&#36825;&#31687;&#25991;&#31456;&#20102;&#12290;&#20854;&#23454;&#65292;&#26368;&#37325;&#35201;&#30340;&#19968;&#28857;&#22312;&#20110;&#65292; &#22914;&#26524;&#35821;&#35328;&#25903;&#25345;&#30495;&#27491;&#30340;continuation&#65292;&#37027;&#20040;&#25105;&#20204;&#21487;&#20197;&#24456;&#23481;&#26131;&#22320;&#23454;&#29616;CPS&#21644;&#38750;CPS&#31243;&#24207;&#38388;&#30340;&#20114;&#30456;&#35843;&#29992;&#12290;&#25152;&#20197;&#65292;&#22312;&#36825;&#20123;&#35821;&#35328;&#20013;&#65292;&#24744;&#21487;&#20197;&#29992;&#19978;&#38754;&#31532;&#19968;&#31181;&#26041;&#27861;&#20889;&#29468;&#25968;&#23383;&#28216;&#25103;&#65292;&#35753;compiler&#65292;runtime machine&#21644;&#19968;&#20010;&#26694;&#26550;&#26469;&#22788;&#29702;&#35752;&#21388;&#30340;CPS&#37096;&#20998;&#12290;</p><p>&#25152;&#20197;&#65292;&#25509;&#19979;&#26469;&#23601;&#35753;&#25105;&#20204;&#26469;&#30475;&#19968;&#20010;&#30495;&#27491;&#25903;&#25345;continuation&#30340;&#35821;&#35328;&#65292;Ruby&#65292;&#20197;&#21450;&#29992;&#20197;&#25552;&#20379;&#35813;&#25903;&#25345;&#30340;&#26680;&#24515;&#20989;&#25968;&#65292;call/cc&#12290;&#36825;&#37324;&#20808;&#25552;&#37266;&#24744;&#19968;&#19979;&#65292;&#27491;&#30830;&#20351;&#29992;call/cc&#38750;&#24120;&#22256;&#38590;&#12290;&#22914;&#26524;&#24744;&#35273;&#24471;&#19979;&#19968;&#31456;&#38590;&#20197;&#29702;&#35299;&#65292;&#20063;&#19981;&#35201;&#35273;&#24471;&#21463;&#21040;&#25387;&#25240;&#65292;&#22240;&#20026;&#23454;&#38469;&#19978;&#25105;&#20204;&#24635;&#20250;&#29992;&#19968;&#20123;&#26694;&#26550;&#26469;&#22788;&#29702;&#36825;&#20123;&#24213;&#23618;&#30340;&#38382;&#39064;&#65292;&#25152;&#20197;&#32593;&#32476;&#31243;&#24207;&#21592;&#20960;&#20046;&#27704;&#36828;&#19981;&#20250;&#30452;&#25509;&#29992;&#21040;call/cc&#26412;&#36523;&#12290;&#26412;&#25991;&#21518;&#21322;&#37096;&#20998;&#23601;&#20250;&#20171;&#32461;&#36825;&#26679;&#30340;&#20004;&#20010;&#26694;&#26550;&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch01s03.html">Prev</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ch01.html">Up</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch02.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">3.&nbsp;CPS&#19982;goto&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;Chapter&nbsp;2.&nbsp;Continuation&#65292;call/cc&#20989;&#25968;&#19982;&#22238;&#36864;&#65295;&#21047;&#26032;&#38190;</td></tr></table></div></body></html>