<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#21069;&#35328;</title><link rel="stylesheet" href="html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.69.1"><link rel="start" href="index.html" title="Java&#32593;&#32476;&#31243;&#24207;&#21592;&#30475;Continuation"><link rel="up" href="index.html" title="Java&#32593;&#32476;&#31243;&#24207;&#21592;&#30475;Continuation"><link rel="prev" href="pr01.html" title="&#29256;&#26435;&#22768;&#26126;"><link rel="next" href="ch01.html" title="Chapter&nbsp;1.&nbsp;CPS&#19982;&#32593;&#32476;&#31243;&#24207;&#27969;&#31243;&#25511;&#21046;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#21069;&#35328;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="pr01.html">Prev</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch01.html">Next</a></td></tr></table><hr></div><div class="preface" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="d0e22"></a>&#21069;&#35328;</h2></div></div></div><p>Continuation&#26159;functional programming language&#37324;&#30340;&#19968;&#20010;&#37325;&#35201;&#27010;&#24565;&#65292;&#19981;&#36807;&#22312;&#25105;&#20204;&#36825;&#20123;Java&#31243;&#24207;&#21592;&#30524;&#37324;&#30475;&#26469;&#65292;&#23427;&#21487;&#33021;&#31616;&#30452;&#36319;&#40657;&#33394;&#39764;&#27861;&#19968;&#26679;&#12290;&#20107;&#23454;&#19978;&#65292;&#33258;60&#24180;&#20195;MIT&#30340;Steve Russell&#65288;&#39034;&#20415;&#25552;&#19968;&#19979;&#65292;&#27492;&#20154;&#20063;&#20889;&#20102;&#19990;&#30028;&#19978;&#31532;&#19968;&#20010;&#30005;&#33041;&#28216;&#25103;&#65289;&#25552;&#20986;&#36825;&#20010;&#27010;&#24565;&#20197;&#26469;&#65292;continuation&#23601;&#20960;&#20046;&#20174;&#26410;&#22312;&#23454;&#38469;&#31243;&#24207;&#20013;&#24471;&#21040;&#24191;&#27867;&#24212;&#29992;&#65292;continuation&#30340;&#19987;&#23478;&#20063;&#22823;&#22810;&#26159;&#30740;&#31350;functional&#35821;&#35328;compiler&#20248;&#21270;&#25216;&#26415;&#30340;&#19968;&#20123;&#8220;&#31185;&#23398;&#24618;&#20154;&#8221;&#12290;</p><p>&#19981;&#36807;&#36825;&#31181;&#29366;&#20917;&#21487;&#33021;&#24456;&#24555;&#23601;&#20250;&#24443;&#24213;&#25913;&#21464;&#65292;&#36234;&#26469;&#36234;&#22810;&#30340;&#32593;&#32476;&#24212;&#29992;&#31243;&#24207;&#30340;&#31243;&#24207;&#21592;&#21487;&#33021;&#37117;&#23558;&#25104;&#20026;continuation&#39640;&#25163;&#12290;&#25110;&#35768;&#24744;&#20250;&#35748;&#20026;&#25105;&#23545;continuation&#30340;&#39044;&#27979;&#36807;&#20110;&#20048;&#35266;&#65292;&#20294;&#26159;&#21363;&#20351;&#24744;&#19981;&#29992;continuation&#65292;&#25226;&#23427;&#19982;web&#32467;&#21512;&#30340;&#20248;&#38597;&#23545;&#20110;&#28909;&#34935;&#25506;&#32034;&#30340;&#20154;&#26412;&#36523;&#20063;&#26159;&#19968;&#31181;&#26497;&#22823;&#30340;&#20139;&#21463;&#12290;&#32780;&#21518;&#32773;&#36825;&#27491;&#26159;&#25105;&#20889;&#36825;&#31687;&#25991;&#31456;&#30340;&#20027;&#35201;&#21407;&#22240;&#12290;</p><p>&#29616;&#22312;&#30340;&#32593;&#32476;&#24212;&#29992;&#31243;&#24207;&#26377;&#20160;&#20040;&#38382;&#39064;&#65311;&#32593;&#32476;&#24212;&#29992;&#31243;&#24207;&#65292;&#36825;&#20010;&#21517;&#23383;&#26412;&#36523;&#23601;&#20805;&#28385;&#20102;&#30683;&#30462;&#12290;WWW&#30340;&#26681;&#22522;http&#26159;&#19968;&#20010;stateless&#30340;&#21327;&#35758;&#65292;&#23427;&#30340;&#24378;&#22788;&#22312;&#20110;&#26174;&#31034;&#21547;&#26377;&#36229;&#38142;&#25509;&#30340;&#39029;&#38754;&#65292;&#32780;&#19981;&#26159;&#20889;&#31243;&#24207;&#12290;&#33509;&#19981;&#26159;netscape&#21518;&#26469;&#22312;&#32593;&#26223;&#27983;&#35272;&#22120;&#20013;&#21152;&#20837;&#20102;cookie&#65292;&#22312;http&#22522;&#30784;&#19978;&#20889;&#8220;&#31243;&#24207;&#8221;&#26681;&#26412;&#23601;&#19981;&#21487;&#33021;&#12290;&#22312;&#8220;&#27491;&#32479;&#8221;&#30340;&#32593;&#32476;&#35774;&#35745;&#20013;&#65292;&#25105;&#20204;&#24212;&#35813;&#29992;pop3&#21644;smtp&#25910;&#21457;email&#65292;&#29992;ftp&#20256;&#36755;&#25991;&#20214;&#65292;&#29992;nntp&#30475;&#35770;&#22363;&#65292;&#22914;&#27492;&#31561;&#31561;&#12290;&#36825;&#20123;&#21327;&#35758;&#37117;&#26159;stateful&#30340;&#65292;&#32780;&#19988;&#23427;&#20204;&#37117;&#26159;&#38024;&#23545;&#29305;&#23450;&#30340;&#19968;&#31867;&#24212;&#29992;&#31243;&#24207;&#25152;&#20889;&#30340;&#65292;&#36825;&#20351;&#24471;&#23427;&#20204;&#22312;&#27010;&#24565;&#21644;&#23454;&#29616;&#19978;&#37117;&#21487;&#20197;&#38750;&#24120;&#31616;&#27905;&#12290;&#21487;&#26159;&#29616;&#22312;&#65292;&#25152;&#26377;&#36825;&#20123;&#20107;&#24448;&#24448;&#37117;&#26159;&#29992;http&#23436;&#25104;&#30340;&#12290;</p><p>&#19981;&#20165;&#22914;&#27492;&#65292;&#32593;&#32476;&#24212;&#29992;&#31243;&#24207;&#36824;&#22312;&#21464;&#24471;&#36234;&#26469;&#36234;&#22797;&#26434;&#65292;&#36825;&#20419;&#20351;&#25105;&#20204;&#19981;&#26029;&#22320;&#23547;&#25214;&#26032;&#30340;&#21150;&#27861;&#31616;&#21270;&#32593;&#32476;&#24212;&#29992;&#31243;&#24207;&#23454;&#29616;&#19978;&#21644;&#27010;&#24565;&#19978;&#30340;&#22797;&#26434;&#24230;&#12290;&#20174;&#38656;&#35201;&#31243;&#24207;&#21592;&#33258;&#24049;&#22788;&#29702;http&#21327;&#35758;&#30340;CGI&#65292;&#21040;&#25552;&#20379;&#20102;&#23545;session&#31561;&#25903;&#25345;&#20294;&#20173;&#28982;&#20197;&#39029;&#38754;&#20026;&#26680;&#24515;&#30340;PHP&#31561;&#33050;&#26412;&#35821;&#35328;&#65292;&#21040;&#37325;&#26032;&#24341;&#20837;&#26700;&#38754;&#31243;&#24207;&#30340;component&#27010;&#24565;&#30340;tapestry&#65292;&#21040;&#29616;&#22312;&#36824;&#26410;&#33719;&#24471;&#24191;&#27867;&#24212;&#29992;&#30340;Java Web Start&#31561;Rich Internet Application&#25216;&#26415;&#65292;&#21487;&#20197;&#35828;&#32593;&#32476;&#24212;&#29992;&#31243;&#24207;&#25216;&#26415;&#30340;&#21457;&#23637;&#21490;&#23601;&#26159;&#19968;&#20010;&#38271;&#26399;&#19981;&#26029;&#30340;&#35797;&#22270;&#32416;&#27491;http&#21327;&#35758;&#20808;&#22825;&#35774;&#35745;&#32570;&#38519;&#30340;&#36807;&#31243;&#12290;</p><p>&#36817;&#20123;&#24180;&#26469;&#26032;&#30340;&#32593;&#32476;&#31243;&#24207;&#26694;&#26550;&#21487;&#20197;&#35828;&#20196;&#20154;&#30446;&#19981;&#26247;&#25509;&#12290;&#20197;Java&#20026;&#20363;&#65292;EJB&#65292;struts&#65292;Spring&#65292;tapestry&#65292;JSF&#65292;portlet&#65292;&#19968;&#20010;&#20010;&#21517;&#23383;&#26469;&#26469;&#21435;&#21435;&#65292;&#21487;&#24796;&#30340;&#26159;&#65292;&#25105;&#20204;&#36824;&#36828;&#36828;&#27809;&#26377;&#25214;&#21040;&#32534;&#20889;&#32593;&#32476;&#24212;&#29992;&#31243;&#24207;&#30340;&#26368;&#20339;&#27169;&#24335;&#12290;&#19981;&#36807;&#24635;&#30340;&#26469;&#35828;&#65292;&#20197;&#19978;&#26694;&#26550;&#26377;&#19968;&#20010;&#20849;&#21516;&#28857;&#65292;&#37027;&#23601;&#26159;&#20174;&#32593;&#32476;&#26550;&#26500;&#35282;&#24230;&#26469;&#30475;&#65292;&#23427;&#20204;&#37117;&#26159;&#22312;&#24212;&#29992;&#23618;&#19978;&#20026;&#19979;&#23618;&#21327;&#35758;&#25171;&#19978;&#19968;&#20010;&#21448;&#19968;&#20010;&#34917;&#19969;&#12290;&#19982;&#20043;&#30456;&#27604;&#65292;continuation&#25552;&#20986;&#20102;&#38382;&#39064;&#30340;&#21478;&#19968;&#20010;&#35299;&#27861;&#65292;&#23427;&#28145;&#20837;&#35821;&#35328;&#24213;&#23618;&#65292;&#22312;compiler&#21644;virtual machine&#30340;&#24110;&#21161;&#19979;&#25226;&#26080;&#29366;&#24577;&#30340;http&#21464;&#24471;&#23481;&#26131;&#20351;&#29992;&#12290;</p><p>&#36825;&#29255;&#25991;&#31456;&#23558;&#20250;&#24102;&#24744;&#36827;&#20837;continuation&#30340;&#19990;&#30028;&#12290;&#22312;&#36825;&#37324;&#24744;&#20250;&#30475;&#21040;&#19981;&#29087;&#24713;&#30340;&#27010;&#24565;&#65292;&#22855;&#24618;&#30340;&#35821;&#35328;&#65292;&#21476;&#32769;&#30340;&#24320;&#21457;&#29615;&#22659;&#12290;&#25105;&#24076;&#26395;&#23545;&#20110;&#24744;&#26469;&#35828;&#65292;&#36825;&#23601;&#20687;&#26159;&#21435;&#38750;&#27954;&#26576;&#20010;&#34987;&#20154;&#36951;&#24536;&#30340;&#35282;&#33853;&#25506;&#38505;&#19968;&#26679;&#26032;&#22855;&#26377;&#36259;&#12290;</p><p>&#26412;&#25991;&#20013;&#30340;&#20840;&#37096;&#20195;&#30721;&#22312;gcc 3.3&#65292;Java 1.4.2&#65292;Ruby 1.8.3&#65292;Squeak 3.8.9&#65292;Seaside 2.5&#21644;rife 1.3.1&#19979;&#36816;&#34892;&#36890;&#36807;&#12290;&#26412;&#25991;&#20013;&#24182;&#27809;&#26377;&#29992;&#21040;&#19978;&#36848;&#36719;&#20214;&#20219;&#20309;&#26368;&#26032;&#25110;&#32773;&#19981;&#31283;&#23450;&#30340;&#21151;&#33021;&#65292;&#25152;&#20197;&#24744;&#22312;&#20854;&#20182;&#36739;&#32769;&#25110;&#36739;&#26032;&#29256;&#26412;&#19979;&#36816;&#34892;&#24212;&#35813;&#20063;&#33021;&#36890;&#36807;&#12290;&#22914;&#26524;&#24744;&#26377;&#20219;&#20309;&#30097;&#38382;&#65292;&#35831;&#30005;&#37038;&#20316;&#32773;&#65306;liuchangjohn AT gmail DOT com&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="pr01.html">Prev</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch01.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#29256;&#26435;&#22768;&#26126;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;Chapter&nbsp;1.&nbsp;CPS&#19982;&#32593;&#32476;&#31243;&#24207;&#27969;&#31243;&#25511;&#21046;</td></tr></table></div></body></html>