<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#21518;&#35760;</title><link rel="stylesheet" href="html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.69.1"><link rel="start" href="index.html" title="Java&#32593;&#32476;&#31243;&#24207;&#21592;&#30475;Continuation"><link rel="up" href="index.html" title="Java&#32593;&#32476;&#31243;&#24207;&#21592;&#30475;Continuation"><link rel="prev" href="ch05s04.html" title="4.&nbsp;&#29468;&#25968;&#23383;&#20043;Rife&#29256;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#21518;&#35760;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch05s04.html">Prev</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;</td></tr></table><hr></div><div class="preface" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="d0e793"></a>&#21518;&#35760;</h2></div></div></div><p>&#35835;&#23436;&#20102;&#26412;&#25991;&#65292;&#24744;&#29616;&#22312;&#23545;continuation&#24212;&#35813;&#24050;&#32463;&#26377;&#30456;&#24403;&#30340;&#35748;&#35782;&#20102;&#65292;&#25110;&#35768;&#20063;&#26377;&#20102;&#24456;&#22823;&#30340;&#20852;&#36259;&#12290;&#38500;&#20102;&#25105;&#20204;&#31616;&#30053;&#20171;&#32461;&#30340;Seaside&#21644;Rife&#22806;&#65292;&#27604;&#36739;&#33879;&#21517;&#30340;&#22522;&#20110;continuation&#30340;&#26694;&#26550;&#36824;&#26377;Ruby&#30340;Borges&#65288;Seaside&#30340;&#20811;&#38534;&#65289;&#65292;Lisp&#30340;UnCommon Web&#31561;&#31561;&#12290;&#32780;&#36825;&#20854;&#20013;&#26368;&#31283;&#23450;&#26368;&#25104;&#29087;&#30340;&#26080;&#30097;&#26159;Seaside&#21644;Rife&#20102;&#65288;&#34429;&#28982;Rife&#24182;&#19981;&#31639;&#26159;<span class="emphasis"><em>&#22522;&#20110;</em></span>continuation&#30340;&#26694;&#26550;&#65289;&#12290;</p><p>&#25226;continuation&#29992;&#20110;&#32593;&#32476;&#31243;&#24207;&#31639;&#26159;&#27604;&#36739;&#36817;&#26399;&#30340;&#21457;&#23637;&#65292;&#35201;&#30495;&#27491;&#22823;&#35268;&#27169;&#30340;&#20351;&#29992;&#36824;&#38656;&#35201;&#35299;&#20915;&#20960;&#20010;&#38382;&#39064;&#65292;&#20854;&#20013;&#26368;&#37325;&#35201;&#30340;&#35201;&#31639;&#25928;&#29575;&#38382;&#39064;&#20102;&#12290;&#32500;&#25345;&#22823;&#37327;&#30340;continuation&#38656;&#35201;&#28040;&#32791;&#30456;&#24403;&#30340;&#20869;&#23384;&#65292;&#32780;&#19988;&#22823;&#37096;&#20998;&#26694;&#26550;&#24182;&#19981;&#25903;&#25345;&#25226;continuation&#23384;&#20837;&#25991;&#20214;&#25110;&#32773;&#25968;&#25454;&#24211;&#20013;&#12290;&#19981;&#36807;&#65292;&#20351;&#29992;continuation&#26694;&#26550;&#21040;&#24213;&#23545;&#25928;&#29575;&#26377;&#22810;&#22823;&#24433;&#21709;&#65292;&#30446;&#21069;&#36824;&#19981;&#26159;&#24456;&#28165;&#26970;&#65307;&#20174;&#22909;&#30340;&#19968;&#38754;&#35762;&#65292;&#36825;&#20063;&#23601;&#26159;&#35828;&#24433;&#21709;&#19981;&#26159;&#22826;&#26126;&#26174;&#12290;&#25152;&#20197;&#65292;&#22914;&#26524;&#24744;&#24819;&#20889;&#19979;&#19968;&#20010;slashdot&#65292;&#37027;&#23601;&#20808;&#19981;&#35201;&#29992;continuation&#20102;&#65307;&#20294;&#26159;&#22914;&#26524;&#20889;&#30340;&#26159;&#36923;&#36753;&#22797;&#26434;&#30340;&#20225;&#19994;&#20869;&#37096;&#32593;&#32476;&#65292;&#37027;&#20040;continuation&#26159;&#24456;&#20540;&#24471;&#32771;&#34385;&#30340;&#12290;</p><p>&#20174;&#21478;&#19968;&#26041;&#38754;&#35762;&#65292;continuation&#20063;&#24341;&#36215;&#25105;&#20204;&#23545;Java&#30340;&#24605;&#32771;&#12290;Java&#35821;&#35328;&#29616;&#22312;&#27491;&#22788;&#22312;&#19968;&#20010;&#21313;&#20998;&#26377;&#36259;&#30340;&#26102;&#26399;&#12290;&#34429;&#28982;&#23427;&#26159;&#38745;&#24577;&#35821;&#35328;&#65292;&#20294;&#26159;&#36817;&#26469;&#30340;&#24456;&#22810;&#21457;&#23637;&#65292;&#22914;reflection&#65292;dynamic proxy&#65292;AOP&#29978;&#33267;annotation&#31561;&#31561;&#65292;&#37117;&#26159;&#20256;&#32479;&#38745;&#24577;&#35821;&#35328;&#22914;C&#26681;&#26412;&#27809;&#26377;&#30340;&#12290;&#21463;&#21040;Java&#35821;&#35328;&#30340;&#38480;&#21046;&#65292;&#36825;&#20854;&#20013;&#30340;&#19968;&#37096;&#20998;&#21644;continuation&#19968;&#26679;&#65292;&#37117;&#35201;&#29992;&#21040;bytecode&#22788;&#29702;&#12290;&#25105;&#20204;&#22914;&#27492;&#28385;&#19981;&#22312;&#20046;&#30340;&#36827;&#34892;bytecode&#22788;&#29702;&#65292;&#25105;&#35273;&#24471;&#36825;&#27491;&#35828;&#26126;Java&#35821;&#35328;&#24050;&#32463;&#19981;&#33021;&#23436;&#20840;&#28385;&#36275;&#31243;&#24207;&#21592;&#30340;&#38656;&#35201;&#20102;&#12290;</p><p>Ruby&#65292;Groovy&#31561;&#35821;&#35328;&#30340;&#22823;&#32902;&#39118;&#34892;&#20284;&#20046;&#20063;&#21521;&#25105;&#20204;&#35777;&#26126;&#20102;&#31243;&#24207;&#21592;&#20204;&#27491;&#22312;&#35201;&#27714;&#36234;&#26469;&#36234;&#22810;&#30340;&#21160;&#24577;&#35821;&#35328;&#21151;&#33021;&#12290;&#25105;&#35273;&#24471;&#65292;&#23601;&#31639;&#26368;&#22362;&#20915;&#30340;Java&#25903;&#25345;&#32773;&#31169;&#19979;&#20063;&#20250;&#20026;Ruby on Rails&#30340;&#26576;&#20123;&#33021;&#21147;&#26263;&#33258;&#24778;&#21497;&#12290;&#20225;&#19994;&#32423;&#24212;&#29992;&#20197;&#21518;&#20250;&#19981;&#20250;&#20063;&#23545;Java&#30340;&#21160;&#24577;&#35821;&#35328;&#21151;&#33021;&#25552;&#20986;&#36234;&#26469;&#36234;&#33499;&#21051;&#30340;&#35201;&#27714;&#65311;&#27604;&#22914;&#35201;&#27714;&#29992;&#39640;&#25928;&#29575;&#30340;continuation&#20889;web&#12289;&#29992;Domain Specific Language&#21462;&#20195;XML hell&#12289;&#29992;&#31867;&#20284;LISP&#30340;macro&#26469;&#24178;&#20928;&#22320;&#23454;&#29616;bytecode&#22788;&#29702;&#65311;&#22312;Java&#19978;&#25171;&#34917;&#19969;&#30340;&#21150;&#27861;&#33021;&#21542;&#28385;&#36275;&#25105;&#20204;&#25152;&#26377;&#30340;&#36825;&#20123;&#38656;&#27714;&#65311;&#36825;&#20010;&#36807;&#31243;&#20250;&#22312;&#21738;&#37324;&#20572;&#27490;&#65311;&#25110;&#32773;&#65292;&#25105;&#20204;&#20250;&#19981;&#20250;&#26368;&#32456;&#24930;&#24930;&#25918;&#24323;Java&#65292;&#24178;&#33030;&#25913;&#29992;&#19968;&#31181;&#21160;&#24577;&#35821;&#35328;&#65311;&#36825;&#25105;&#20204;&#23601;&#19981;&#24471;&#32780;&#30693;&#20102;&#12290;</p><p>&#19981;&#35770;&#26085;&#21518;&#30340;&#21457;&#23637;&#22914;&#20309;&#65292;&#22914;&#25105;&#22312;&#21069;&#35328;&#25152;&#35828;&#65292;&#25226;continuation&#19982;web&#32467;&#21512;&#30340;&#20248;&#38597;&#23545;&#20110;&#28909;&#34935;&#25506;&#32034;&#30340;&#20154;&#26412;&#36523;&#23601;&#26159;&#19968;&#31181;&#26497;&#22823;&#30340;&#20139;&#21463;&#12290;&#25152;&#20197;&#65292;&#34429;&#28982;&#24744;&#21487;&#33021;&#36824;&#19981;&#20250;&#31435;&#21051;&#24320;&#22987;&#29992;continuation&#65292;&#20294;&#26159;&#25105;&#24076;&#26395;&#24744;&#24050;&#32463;&#23545;&#32593;&#32476;&#21644;&#23545;&#35745;&#31639;&#26426;&#35821;&#35328;&#26377;&#20102;&#19968;&#20010;&#26032;&#30340;&#35748;&#35782;&#65292;&#32780;&#19988;&#24744;&#30340;&#27714;&#30693;&#27442;&#22312;&#30701;&#26399;&#20869;&#24471;&#21040;&#20102;&#28385;&#36275;&#12290;&#36825;&#23601;&#36275;&#22815;&#20102;&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch05s04.html">Prev</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;</td></tr><tr><td width="40%" align="left" valign="top">4.&nbsp;&#29468;&#25968;&#23383;&#20043;Rife&#29256;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;</td></tr></table></div></body></html>